NikolayBobovnikov/ircapture/auvir_embed/mocap/transmitter/stm32f103/Src/main.c
                // transitional state
                // TODO: check if possible to move to beginning of next state (thus remove delay)
                case STAGE_ON2:
                {
                    phtim_envelop->Instance->ARR = PeriodBetweenDataFrames;
                    StartStopSequenceTransmitState = STAGE_0;
                    TransmitterState = TX_DELAY;
                    break;
                }
            }
            break;
        }
        case TX_DELAY:
        {
            phtim_envelop->Instance->ARR = PeriodOfStartStopBits;
            StartStopSequenceTransmitState = STAGE_0;
            TransmitterState = TX_WAITING_FOR_TRANSMISSION;

            break;
        }
    } // switch(TransmitterState)
}

void force_envelop_timer_output_on()
{
    // Start pwm timer, depending on timer and channel number
    switch(currentOutputTimChannel)
    {
        case Timer2Channel1:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer2Channel2:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer2Channel3:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer2Channel4:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_4); // carrier
            break;
        }
        case Timer3Channel1:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer3Channel2:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer3Channel3:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer3Channel4:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4); // carrier
            break;
        }
        case Timer4Channel1:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer4Channel2:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer4Channel3:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer4Channel4:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_4); // carrier
            break;
        }
    }

    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
}
void force_envelop_timer_output_off()
{
/*
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1); // carrier
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_2); // carrier
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_3); // carrier
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_4); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_1); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_2); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_3); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_4); // carrier
        */

    // Stopt pwm timer, depending on timer and channel number
    switch(currentOutputTimChannel)
    {
        case Timer2Channel1:
        {
            HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer2Channel2:
        {
            HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer2Channel3:
        {
            HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer2Channel4:
        {
            HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_4); // carrier
            break;
        }  
        case Timer3Channel1:
        {
            HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer3Channel2:
        {
            HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer3Channel3:
        {
            HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer3Channel4:
        {
            HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_4); // carrier
            break;
        }
        case Timer4Channel1:
        {
            HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer4Channel2:
        {
            HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer4Channel3:
        {
            HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer4Channel4:
        {
            HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_4); // carrier
            break;
        }
    }


    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
}
void nop(){}
/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
